data_ = [   
            ['Підприємство', 'Вид основних засобів', 'Залишок на 1.01.18',
             'Надійшло у 2018', 'Вибуло у 2018', 'Залишок на 1.01.19',
             'Зміни вартості за рік'],
            ['Дніпрянка', 'Будівлі', 22456, 365, 123, 22698, 242],
            ['Дніпрянка', 'Машини та обладнання', 10087, 15972, 58, 26001, 15914],
            ['Дніпрянка', 'Транспортні засоби', 206, 34, 50, 190, -16],
            ['Дніпрянка', 'Інструмент та інвентар', 34, 23, 25, 32, -2],
            ['Універсам 22', 'Будівлі', 44048, 500, 200, 44348, 300],
            ['Універсам 22', 'Машини та обладнання', 5564, 2571, 135, 8000, 2436],
            ['Універсам 22', 'Транспортні засоби', 12, 33, 3, 42, 30],
            ['Універсам 22', 'Інструмент та інвентар', 116, 64, 23, 157, 41]
        ]

