text = '''У пору спекотливого весняного заходу сонця на Патріарших ставках з’явилося двоє громадян.
Перший з них — приблизно сорокарічний, зодягнутий у сіреньку літню пару, — був малого зросту, темноволосий,
вгодований, з лисиною, свого респектабельного капелюха пиріжком ніс у руці, а ретельно поголене обличчя його
прикрашали надприродні за розмірами окуляри в чорній роговій оправі. Другий — плечистий, рудий, чубастий молодик
у збитій на потилицю картатій кепці — був у ковбойці, жмаканих білих штанях і чорних тапочках.

Перший був не хто інший, як Михайло Олександрович Берліоз, редактор товстого художнього журналу і голова
правління однієї з найбільших московських літературних асоціацій, скорочено званої МАСОЛІТ, а молодий супутник його —
поет Іван Миколайович Понир’єв, що писав під псевдонімом Бездомний.

Втрапивши в тінь ледь зазеленілих лип, письменники найперше кинулися до строкато розмальованої ятки з написом "Пиво і води".

Ба, слід відзначити першу дивовижу цього страшного травневого вечора. Не тільки біля ятки, а й по всій алеї,
рівнобіжній до Малої Бронної вулиці, не було ані душі. В ту пору, коли вже, здається, і сили бракло дихати, коли сонце,
розпікши Москву, в сухій імлі валилося кудись за Садове кільце, — ніхто не прийшов під липи, ніхто не сів на лаву, безлюдна була алея.

— Дайте нарзану, — попросив Берліоз.

— Нарзану нема, — відповіла жінка в ятці й чомусь образилася.

— Пиво є? — хрипко звідався Бездомний.

— Пиво привезуть увечері, — відповіла жінка.

— А що є? — запитав Берліоз.

— Абрикосова, тільки тепла, — сказала жінка.

— Ну, давайте, давайте, давайте!..

Абрикосова утворила пишну жовту піну, і в повітрі запахло перукарнею. Напившись, літератори відразу ж запікали,
розплатилися й посідали на лаві обличчям до ставка і спиною до Бронної.

Цієї хвилини скоїлася друга дивовижа, що стосувалася самого Берліоза. Він раптом перестав гикати, серце його тріпнулось
і на мить кудись провалилося, потім стало на місце, але з тупою голкою, що застрягла в ньому. До того ж Берліоза охопив безпричинний,
проте такий великий страх, що йому притьмом захотілося неозирки тікати з Патріарших.

Берліоз тоскно розглянувся, не розуміючи, що його так налякало. Він зблід, витер хусточкою лоба, подумав:
"Що це зі мною? Такого ніколи не бувало... серце каверзує... я перевтомився... Мабуть, пора кинути все до біса і в Кисловодськ..."

Тієї миті гаряче повітря згусло перед ним, і зіткався із цього повітря прозорий громадянин предивного вигляду.
На маленькій голівці жокейський картузик, картатий куценький теж таки з повітря піджачок... Громадянин на зріст у
сажень, але в плечах вузький, худий неймовірно, і фізіономія, прошу зважити, глумлива.

Життя Берліозове складалося так, що дивовижні явища не були для нього у звичай. Ще дужче збліднувши, він витріщив
очі й у замішанні подумав: "Цього не може бути!.."
Але воно таки було, і цибатий, проглядний наскрізь громадянин, не торкаючись землі, хилитався перед ним то вліво, то вправо.

Тепер жах такою мірою опосів Берліоза, що він заплющив очі. А коли голова МАСОЛІТу розплющив їх, — побачив, що все скінчилося,
марево розвіялося, картатий щез, а водночас і тупа голка вискочила з серця.

— Тьху ти, чортяка! — вигукнув редактор. — Ти знаєш, Іване, зі мною оце мало удар від спеки не стався!
Навіть щось як галюцинація було, — він спробував посміхнутись, але в очах йому ще билася тривога, і руки тремтіли.
Проте поволі він заспокоївся, обмахнувся хусточкою і, проказавши досить бадьоро: "Отож виходить..." — повів далі мову,
перервану питтям абрикосової.'''
