import matplotlib.pyplot as plt
from collections import Counter
import pylab

text = "Хрущі над вишнями гудуть,\
        Плугатарі з плугами йдуть,\
        Співають ідучи дівчата,\
        А матері вечерять ждуть.\
        Сем'я вечеря коло хати,\
        Вечірня зіронька встає.\
        Дочка вечерять подає,\
        А мати хоче научати,\
        Так соловейко не дає.\
        Поклала мати коло хати\
        Маленьких діточок своїх;\
        Сама заснула коло їх.\
        Затихло все, тілько дівчата\
        Та соловейко не затих."

def lettersBar():
    alphabet = ['а', 'б', 'в', 'г', 'ґ', 'д',\
                'е', 'є', 'ж', 'з', 'и', 'і',\
                'ї', 'й', 'к', 'л', 'м', 'н',\
                'о', 'п', 'р', 'с', 'т', 'у',\
                'ф', 'х', 'ц', 'ч', 'ш', 'щ',\
                'ь', 'ю', 'я']

    for i in range(0, len(alphabet)):

        xdata = [alphabet[i]]
        ydata = [text.count(alphabet[i])]
        pylab.bar(xdata, ydata)

    pylab.show()

lettersBar()



